cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>AV_PAIRS_32B09</name>
          <description>32b Addr/Value pair Section</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Address or Value Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AV_PAIRS_32B10</name>
          <description>32b Addr/Value pair Section</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Address or Value Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AV_PAIRS_32B11</name>
          <description>32b Addr/Value pair Section</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Address or Value Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AV_PAIRS_32B12</name>
          <description>32b Addr/Value pair Section</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Address or Value Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AV_PAIRS_32B13</name>
          <description>32b Addr/Value pair Section</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Address or Value Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AV_PAIRS_32B14</name>
          <description>32b Addr/Value pair Section</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Address or Value Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AV_PAIRS_32B15</name>
          <description>32b Addr/Value pair Section</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Address or Value Word</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUSS_WOUNDING</name>
          <description>CPUSS Wounding Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Data to use for register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SILICON_ID</name>
          <description>Silicon ID</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>Silicon ID</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUSS_PRIV_RAM</name>
          <description>RAM Privileged Limit</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Data to use for register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUSS_PRIV_FLASH</name>
          <description>Flash Privileged Limit</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA32</name>
              <description>Data to use for register</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIB_KEY_DELAY</name>
          <description>Hibernate wakeup value for PWR_KEY_DELAY</description>
          <addressOffset>0x150</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WAKEUP_HOLDOFF</name>
              <description>Delay (in 12MHz IMO clock cycles) to wait for references to settle on wakeup from hibernate/deepsleep.  PBOD is ignored and system does not resume until this delay expires. Note that the same delay on POR is hard-coded.</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPSLP_KEY_DELAY</name>
          <description>DeepSleep wakeup value for PWR_KEY_DELAY</description>
          <addressOffset>0x152</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WAKEUP_HOLDOFF</name>
              <description>Delay (in 12MHz IMO clock cycles) to wait for references to settle on wakeup from hibernate/deepsleep.  PBOD is ignored and system does not resume until this delay expires. Note that the same delay on POR is hard-coded.</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_CONFIG</name>
          <description>SWD pinout selector (not present in TSG4/TSG5-M)</description>
          <addressOffset>0x154</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SWD_SELECT</name>
              <description>0: Use Primary SWD location?1: Use Alternate SWD location</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_LISTEN</name>
          <description>Listen Window Length</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CYCLES</name>
              <description>Number of clock cycles</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_START</name>
          <description>Flash Image Start Address</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Start Address</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSD_TRIM1_HVIDAC</name>
          <description>CSD Trim Data for HVIDAC operation</description>
          <addressOffset>0x160</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TRIM8</name>
              <description>Trim data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSD_TRIM2_HVIDAC</name>
          <description>CSD Trim Data for HVIDAC operation</description>
          <addressOffset>0x161</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TRIM8</name>
              <description>Trim data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSD_TRIM1_CSD</name>
          <description>CSD Trim Data for (normal) CSD operation</description>
          <addressOffset>0x162</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TRIM8</name>
              <description>Trim data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSD_TRIM2_CSD</name>
          <description>CSD Trim Data for (normal) CSD operation</description>
          <addressOffset>0x163</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TRIM8</name>
              <description>Trim data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TEMP_MULTIPLIER</name>
          <description>SAR Temperature Sensor Multiplication Factor</description>
          <addressOffset>0x164</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TEMP_MULTIPLIER</name>
              <description>Multiplier value for SAR temperature sensor in fixed point 0.16 format.  Note: this field exists in products that contain SAR (m0s8sar) only.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_TEMP_OFFSET</name>
          <description>SAR Temperature Sensor Offset</description>
          <addressOffset>0x166</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TEMP_OFFSET</name>
              <description>Offset value for SAR temperature sensor in fixed point 10.6 format.  Note: this field exists in products that contain SAR (m0s8sar) only.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SKIP_CHECKSUM</name>
          <description>Checksum Skip Option Register</description>
          <addressOffset>0x169</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SKIP</name>
              <description>0: Perform checksum check (see CHECKSUM fueld below)?1: Skip checksum check?&gt;1: Undefined - do not use</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_VIRGINKEY0</name>
          <description>Virgin Protection Mode Key</description>
          <addressOffset>0x170</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>KEY8</name>
              <description>Key Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_VIRGINKEY1</name>
          <description>Virgin Protection Mode Key</description>
          <addressOffset>0x171</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>KEY8</name>
              <description>Key Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_VIRGINKEY2</name>
          <description>Virgin Protection Mode Key</description>
          <addressOffset>0x172</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>KEY8</name>
              <description>Key Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_VIRGINKEY3</name>
          <description>Virgin Protection Mode Key</description>
          <addressOffset>0x173</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>KEY8</name>
              <description>Key Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_VIRGINKEY4</name>
          <description>Virgin Protection Mode Key</description>
          <addressOffset>0x174</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>KEY8</name>
              <description>Key Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_VIRGINKEY5</name>
          <description>Virgin Protection Mode Key</description>
          <addressOffset>0x175</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>KEY8</name>
              <description>Key Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_VIRGINKEY6</name>
          <description>Virgin Protection Mode Key</description>
          <addressOffset>0x176</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>KEY8</name>
              <description>Key Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROT_VIRGINKEY7</name>
          <description>Virgin Protection Mode Key</description>
          <addressOffset>0x177</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>KEY8</name>
              <description>Key Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIE_LOT0</name>
          <description>Lot Number (3 bytes)</description>
          <addressOffset>0x178</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LOT</name>
              <description>Lot Number Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIE_LOT1</name>
          <description>Lot Number (3 bytes)</description>
          <addressOffset>0x179</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LOT</name>
              <description>Lot Number Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIE_LOT2</name>
          <description>Lot Number (3 bytes)</description>
          <addressOffset>0x17A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LOT</name>
              <description>Lot Number Byte</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIE_WAFER</name>
          <description>Wafer Number</description>
          <addressOffset>0x17B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WAFER</name>
              <description>Wafer Number</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIE_X</name>
          <description>X Position on Wafer, CRI Pass/Fail Bin</description>
          <addressOffset>0x17C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>X</name>
              <description>X Position</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CRI_PASS</name>
              <description>CRI Pass Bin (1-3) or 0 (Fail Bin)</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIE_Y</name>
          <description>Y Position on Wafer, CHI Pass/Fail Bin</description>
          <addressOffset>0x17D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>Y</name>
              <description>Y Position</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CHI_PASS</name>
              <description>CHI Pass Bin (1-3) or 0 (Fail Bin)</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
