cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>DIE_SORT</name>
          <description>Sort1/2/3 Pass/Fail Bin</description>
          <addressOffset>0x17E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>S1_PASS</name>
              <description>SORT1 Pass Bin (1-3) or 0 (Fail Bin)</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S2_PASS</name>
              <description>SORT2 Pass Bin (1-3) or 0 (Fail Bin)</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>S3_PASS</name>
              <description>SORT3 Pass Bin (1-3) or 0 (Fail Bin)</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIE_MINOR</name>
          <description>Minor Revision Number</description>
          <addressOffset>0x17F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MINOR</name>
              <description>Minor revision number</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA00</name>
          <description>PE/TE Data</description>
          <addressOffset>0x180</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA01</name>
          <description>PE/TE Data</description>
          <addressOffset>0x181</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA02</name>
          <description>PE/TE Data</description>
          <addressOffset>0x182</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA03</name>
          <description>PE/TE Data</description>
          <addressOffset>0x183</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA04</name>
          <description>PE/TE Data</description>
          <addressOffset>0x184</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA05</name>
          <description>PE/TE Data</description>
          <addressOffset>0x185</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA06</name>
          <description>PE/TE Data</description>
          <addressOffset>0x186</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA07</name>
          <description>PE/TE Data</description>
          <addressOffset>0x187</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA08</name>
          <description>PE/TE Data</description>
          <addressOffset>0x188</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA09</name>
          <description>PE/TE Data</description>
          <addressOffset>0x189</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA10</name>
          <description>PE/TE Data</description>
          <addressOffset>0x18A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA11</name>
          <description>PE/TE Data</description>
          <addressOffset>0x18B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA12</name>
          <description>PE/TE Data</description>
          <addressOffset>0x18C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA13</name>
          <description>PE/TE Data</description>
          <addressOffset>0x18D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA14</name>
          <description>PE/TE Data</description>
          <addressOffset>0x18E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA15</name>
          <description>PE/TE Data</description>
          <addressOffset>0x18F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA16</name>
          <description>PE/TE Data</description>
          <addressOffset>0x190</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA17</name>
          <description>PE/TE Data</description>
          <addressOffset>0x191</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA18</name>
          <description>PE/TE Data</description>
          <addressOffset>0x192</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA19</name>
          <description>PE/TE Data</description>
          <addressOffset>0x193</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA20</name>
          <description>PE/TE Data</description>
          <addressOffset>0x194</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA21</name>
          <description>PE/TE Data</description>
          <addressOffset>0x195</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA22</name>
          <description>PE/TE Data</description>
          <addressOffset>0x196</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA23</name>
          <description>PE/TE Data</description>
          <addressOffset>0x197</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA24</name>
          <description>PE/TE Data</description>
          <addressOffset>0x198</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA25</name>
          <description>PE/TE Data</description>
          <addressOffset>0x199</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA26</name>
          <description>PE/TE Data</description>
          <addressOffset>0x19A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA27</name>
          <description>PE/TE Data</description>
          <addressOffset>0x19B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA28</name>
          <description>PE/TE Data</description>
          <addressOffset>0x19C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA29</name>
          <description>PE/TE Data</description>
          <addressOffset>0x19D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA30</name>
          <description>PE/TE Data</description>
          <addressOffset>0x19E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PE_TE_DATA31</name>
          <description>PE/TE Data</description>
          <addressOffset>0x19F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA8</name>
              <description>PE/TE Data</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>Preprogram Settings</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period of timer (in units of 36 MHz IMO clock periods).</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PDAC</name>
              <description>PDAC input. Each increment in PDAC causes an increase of ~0.10V in VPOS</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NDAC</name>
              <description>NDAC input. Each increment in NDAC causes an increase of ~0.10V in VNEG</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>E</name>
          <description>Erase Settings</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period of timer (in units of 36 MHz IMO clock periods).</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PDAC</name>
              <description>PDAC input. Each increment in PDAC causes an increase of ~0.10V in VPOS</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NDAC</name>
              <description>NDAC input. Each increment in NDAC causes an increase of ~0.10V in VNEG</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
