cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>P</name>
          <description>Program Settings</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period of timer (in units of 36 MHz IMO clock periods).</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PDAC</name>
              <description>PDAC input. Each increment in PDAC causes an increase of ~0.10V in VPOS</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NDAC</name>
              <description>NDAC input. Each increment in NDAC causes an increase of ~0.10V in VNEG</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EA_E</name>
          <description>Erase All - Erase Settings</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period of timer (in units of 36 MHz IMO clock periods).</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PDAC</name>
              <description>PDAC input. Each increment in PDAC causes an increase of ~0.10V in VPOS</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NDAC</name>
              <description>NDAC input. Each increment in NDAC causes an increase of ~0.10V in VNEG</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EA_P</name>
          <description>Erase All - Program Settings</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period of timer (in units of 36 MHz IMO clock periods).</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PDAC</name>
              <description>PDAC input. Each increment in PDAC causes an increase of ~0.10V in VPOS</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NDAC</name>
              <description>NDAC input. Each increment in NDAC causes an increase of ~0.10V in VNEG</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ES_E</name>
          <description>Erase Sector - Erase Settings</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period of timer (in units of 36 MHz IMO clock periods).</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PDAC</name>
              <description>PDAC input. Each increment in PDAC causes an increase of ~0.10V in VPOS</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NDAC</name>
              <description>NDAC input. Each increment in NDAC causes an increase of ~0.10V in VNEG</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ES_P_EO</name>
          <description>Erase Sector - Program EO Settings</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period of timer (in units of 36 MHz IMO clock periods).</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PDAC</name>
              <description>PDAC input. Each increment in PDAC causes an increase of ~0.10V in VPOS</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NDAC</name>
              <description>NDAC input. Each increment in NDAC causes an increase of ~0.10V in VNEG</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>E_VCTAT</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VCTAT_SLOPE</name>
              <description>Output slope setting controls. The slope of the voltage with temperature varies from ~0% to ~15% from the value at 55C over the temperature range -40C to 150C based on control signal settings 0 to 15</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_VOLTAGE</name>
              <description>Output voltage absolute trim</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_ENABLE</name>
              <description>Enable VCTAT block</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P_VCTAT</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0x1BD</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VCTAT_SLOPE</name>
              <description>Output slope setting controls. The slope of the voltage with temperature varies from ~0% to ~15% from the value at 55C over the temperature range -40C to 150C based on control signal settings 0 to 15</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_VOLTAGE</name>
              <description>Output voltage absolute trim</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_ENABLE</name>
              <description>Enable VCTAT block</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MARGIN</name>
          <description>Margin DAC Control Register</description>
          <addressOffset>0x1BE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MDAC</name>
              <description>Margin DAC input. Each increment increases the VMARG by?~15.6mV</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPCIF_TRIM1</name>
          <description>BDAC control register</description>
          <addressOffset>0x1BF</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BDAC</name>
              <description>BDAC flash input. Trims flash bitline program inhibit voltage. Each increment causes an increase of 0.12V (0V-1.8V)</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_MAXF0</name>
          <description>Max frequency for trim pair</description>
          <addressOffset>0x1C0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MAXFREQ</name>
              <description>Max frequency (3..48) at which IMO_ABS/TMPCO3 is valid (range is IMO_MAXF2+1 .. IMO_MAXF3).</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_ABS0</name>
          <description>Value for PWR_BG_TRIM4 (ICTAT trim for IMO current reference).</description>
          <addressOffset>0x1C1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ABS_TRIM_IMO</name>
              <description>IMO-irefgen output current magnitude trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TMPCO0</name>
          <description>Value for PWR_BG_TRIM5 (ICTAT tempco for IMO current reference).</description>
          <addressOffset>0x1C2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TMPCO_TRIM_IMO</name>
              <description>IMO-irefgen output current temperature co-efficient trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_MAXF1</name>
          <description>Max frequency for trim pair</description>
          <addressOffset>0x1C3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MAXFREQ</name>
              <description>Max frequency (3..48) at which IMO_ABS/TMPCO3 is valid (range is IMO_MAXF2+1 .. IMO_MAXF3).</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_ABS1</name>
          <description>Value for PWR_BG_TRIM4 (ICTAT trim for IMO current reference).</description>
          <addressOffset>0x1C4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ABS_TRIM_IMO</name>
              <description>IMO-irefgen output current magnitude trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TMPCO1</name>
          <description>Value for PWR_BG_TRIM5 (ICTAT tempco for IMO current reference).</description>
          <addressOffset>0x1C5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TMPCO_TRIM_IMO</name>
              <description>IMO-irefgen output current temperature co-efficient trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_MAXF2</name>
          <description>Max frequency for trim pair</description>
          <addressOffset>0x1C6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MAXFREQ</name>
              <description>Max frequency (3..48) at which IMO_ABS/TMPCO3 is valid (range is IMO_MAXF2+1 .. IMO_MAXF3).</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_ABS2</name>
          <description>Value for PWR_BG_TRIM4 (ICTAT trim for IMO current reference).</description>
          <addressOffset>0x1C7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ABS_TRIM_IMO</name>
              <description>IMO-irefgen output current magnitude trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TMPCO2</name>
          <description>Value for PWR_BG_TRIM5 (ICTAT tempco for IMO current reference).</description>
          <addressOffset>0x1C8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TMPCO_TRIM_IMO</name>
              <description>IMO-irefgen output current temperature co-efficient trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_MAXF3</name>
          <description>Max frequency for trim pair</description>
          <addressOffset>0x1C9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MAXFREQ</name>
              <description>Max frequency (3..48) at which IMO_ABS/TMPCO3 is valid (range is IMO_MAXF2+1 .. IMO_MAXF3).</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_ABS3</name>
          <description>Value for PWR_BG_TRIM4 (ICTAT trim for IMO current reference).</description>
          <addressOffset>0x1CA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ABS_TRIM_IMO</name>
              <description>IMO-irefgen output current magnitude trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TMPCO3</name>
          <description>Value for PWR_BG_TRIM5 (ICTAT tempco for IMO current reference).</description>
          <addressOffset>0x1CB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TMPCO_TRIM_IMO</name>
              <description>IMO-irefgen output current temperature co-efficient trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_ABS4</name>
          <description>Value for PWR_BG_TRIM4 (ICTAT trim for IMO current reference).</description>
          <addressOffset>0x1CC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ABS_TRIM_IMO</name>
              <description>IMO-irefgen output current magnitude trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TMPCO4</name>
          <description>Value for PWR_BG_TRIM5 (ICTAT tempco for IMO current reference).</description>
          <addressOffset>0x1CD</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TMPCO_TRIM_IMO</name>
              <description>IMO-irefgen output current temperature co-efficient trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM00</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM01</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1D1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM02</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1D2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM03</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1D3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM04</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM05</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1D5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
