cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>IMO_TRIM40</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM41</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1F9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM42</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1FA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM43</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1FB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM44</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMO_TRIM45</name>
          <description>IMO Trim Register</description>
          <addressOffset>0x1FD</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHECKSUM</name>
          <description>Boot Checksum</description>
          <addressOffset>0x1FE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CHECKSUM</name>
              <description>Checksum of fixed data checked during boot.  This checksum covers all of rows 1,2,3 of macro 0 + row 3 of macro 1 (except this checksum, and row 3 of macro 1 only if it exists).</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SROM_DATA</name>
      <description>No description available</description>
      <baseAddress>0x10000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>buffer</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>CPUSS</name>
      <description>CPU Subsystem</description>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>CPU Subsystem Configuration</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VECS_IN_RAM</name>
              <description>0: Vector Table is located at 0000_0000 in Flash?1: Vector Table is located at 2000_0000 in RAM?Note that vectors for RESET and FAULT are always fetched from ROM. Value in Flash/RAM is ignored for these vectores.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLSH_ACC_BYPASS</name>
              <description>0: Normal operation?1: Flash Accellerator in bypass mode, functions as single 64b line buffer.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSREQ</name>
          <description>System Request Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>COMMAND</name>
              <description>Opcode of the system call being requested.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NO_RST_OVR</name>
              <description>Disable Reset Vector fetch relocation:?0: CPU requests to locations 0000_0000 - 0000_0007 are redirected to SROM?1: CPU requests to locations 0000_0000 - 0000_0007 are made to flash.?Note that this bit defaults to 0 on reset, ensuring actual reset vector fetches are always made to ROM  Flash DFT routines may set this bit to '1' to enable uninhibited read-back of programmed data in the first flash page.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIVILEGED</name>
              <description>Indicates whether the system is in privileged or user mode.  This bit can only be set from ROM code.  Any write to this register that is not originating from ROM will result in clearing this bit.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_ACCESS_EN</name>
              <description>Indicates that access to ROM is currently enabled.  This bit is used for debug purposes only.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>HMASTER</name>
              <description>0: Request was made by Cortex-M0 CPU firmware?1: Request was made by external debugger/ATE probe?Note that any writes to this register while SYSREQ=1 will not change the value of HMASTER (such that the origin of a request can continue to be observed).</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSREQ</name>
              <description>Firmware/ATE writes 1 to request a system call.  This will lead to an immediate NMI (non maskable interrupt).  System call implementation will write 0 after servicing the request.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSARG</name>
          <description>System Request Argument Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ARG32</name>
              <description>Argument to System Call specified in SYSREQ.  Semantics of argument depends on system call made.  Typically a pointer to a parameter block.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROTECTION</name>
          <description>Protection Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PROT</name>
              <description>Current protection mode - this field is available as a global signal everywhere in the system.  Writes to this field are ignored when PROT_LOCK=1.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VIRGIN</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROTECTED</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KILL</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROT_LOCK</name>
              <description>Setting this field will block (ignore) any further writes to the PROT field in this register.  Once set, this field cannot be cleared.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIV_ROM</name>
          <description>Privileged Limit Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ROM_LIMIT</name>
              <description>Indicates the limit where the privileged area of ROM starts in increments of 256B.?0:  Entire ROM is Privileged?1:  First 256B are UserMode accessiable?...?Any number larger than the size of the ROM indicates that the entire ROM is user mode accessible.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIV_RAM</name>
          <description>Privileged Limit Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM_LIMIT</name>
              <description>Indicates the limit where the privileged area of SRAM starts in increments of 256B.?0:  Entire SRAM is Privileged?1:  First 256B are UserMode accessiable?...?Any number larger than the size of the RAM indicates that the entire ROM is user mode accessible.</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIV_FLASH</name>
          <description>Privileged Limit Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>FLASH_LIMIT</name>
              <description>Indicates the limit where the privileged area of FLASH starts in increments of 256B.?0:  Entire FLASH is Privileged?1:  First 256B are UserMode accessiable?...?Any number larger than the size of the FLASH indicates that the entire Flash is user mode accessible.  Note that SuperVisory rows are always Privileged.?If FLASH_LIMIT defines a non-empty privileged area, the boot ROM will assume that a system call table exists at the beginning of the Flash privileged area and use it for all SystemCalls made using CPUSS_SYSREQ.?Note that marking the entire flash as Privileged will generally not work, since all system calls return to User mode before returning (and they would not be able to return to anything in Flash if it was entirely Privileged).</description>
              <lsb>0</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WOUNDING</name>
          <description>Wounding Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM_SIZE</name>
              <description>Indicates size of RAM in this device in units of 256B (0: 0B, 1: 256B, 2: 512B ...)</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>RAM_WOUND</name>
              <description>Indicates the amount of accessible RAM in this part.  The value in this field is effectively write-once (it is only possible to set bits, not clear them).  The remainder portion of RAM is not accessible and will return bus error when accessed (HRESP=1).</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_16</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_32</name>
                  <description>No description available</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_64</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_128</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_WOUND</name>
              <description>Indicates the amount of accessible Flash in this part.  The value in this field is effectively write-once (it is only possible to set bits, not clear them).  The remainder portion of RAM is not accessible and will return bus error when accessed (HRESP=1).</description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_16</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_32</name>
                  <description>No description available</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_64</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_128</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_SELECT</name>
          <description>Interrupt Multiplexer Select Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SELECT32</name>
              <description>When bit&lt;N&gt; is set, NVIC IRQ&lt;N&gt; is connected to DSI.  When cleared it is connected to its fixed function role as defined in SAS/PAS.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
