cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>PORT_SEL3</name>
          <description>Port 3 control register.</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Selects pin 0 source.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM0_P</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_UART_RX</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_I2C_SCL</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_SPI_MOSI</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL1</name>
              <description>Selects pin 1 source.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM0_N</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_UART_TX</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_I2C_SDA</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_SPI_MISO</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL2</name>
              <description>Selects pin 2 source.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM1_P</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWD_IO</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_SPI_CLK</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL3</name>
              <description>Selects pin 3 source.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM1_N</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWD_CLK</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_SPI_SSEL0</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL4</name>
              <description>Selects pin 4 source.</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM2_P</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_SPI_SSEL1</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL5</name>
              <description>Selects pin 5 source.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM2_N</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_SPI_SSEL2</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL6</name>
              <description>Selects pin 6 source.</description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM3_P</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWD_IO</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB1_SPI_SSEL3</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL7</name>
              <description>Selects pin 7 source.</description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCPWM3_N</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWD_CLK</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PORT_SEL4</name>
          <description>Port 4 control register.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SEL0</name>
              <description>Selects pin 0 source.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCB0_UART_RX</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB0_I2C_SCL</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB0_SPI_MOSI</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL1</name>
              <description>Selects pin 1 source.</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCB0_UART_TX</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB0_I2C_SDA</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB0_SPI_MISO</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL2</name>
              <description>Selects pin 2 source.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSD_CMOD</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSD_CMOD_CHRG</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB0_SPI_CLK</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEL3</name>
              <description>Selects pin 3 source.</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSD_CSHTANK</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSD_CSHTANK_CHRG</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCB0_SPI_SSEL0</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
