cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLK</name>
      <description>Programmable clocks</description>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIVIDER_A00</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_A</name>
              <description>Divider value for divider A in the row.  OUTPUT= INPUT / (DIVIDER_A+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_A</name>
              <description>Enable divider A.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_A01</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_A</name>
              <description>Divider value for divider A in the row.  OUTPUT= INPUT / (DIVIDER_A+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_A</name>
              <description>Enable divider A.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_A02</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_A</name>
              <description>Divider value for divider A in the row.  OUTPUT= INPUT / (DIVIDER_A+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_A</name>
              <description>Enable divider A.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_B00</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_B</name>
              <description>Divider value for divider B in the row.  OUTPUT= INPUT / (DIVIDER_B+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).  Also note that dividide by 1 does not work if CASCADE_A_B=1.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE_A_B</name>
              <description>Cascade divider A into divider B</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_B</name>
              <description>Enable divider B.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_B01</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_B</name>
              <description>Divider value for divider B in the row.  OUTPUT= INPUT / (DIVIDER_B+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).  Also note that dividide by 1 does not work if CASCADE_A_B=1.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE_A_B</name>
              <description>Cascade divider A into divider B</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_B</name>
              <description>Enable divider B.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_B02</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_B</name>
              <description>Divider value for divider B in the row.  OUTPUT= INPUT / (DIVIDER_B+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).  Also note that dividide by 1 does not work if CASCADE_A_B=1.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE_A_B</name>
              <description>Cascade divider A into divider B</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_B</name>
              <description>Enable divider B.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_C00</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_C</name>
              <description>Divider value for divider C in the row.  OUTPUT= INPUT / (DIVIDER_C+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).   Also note that dividide by 1 does not work if CASCADE_A_B=1.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE_B_C</name>
              <description>Cascade divider B into divider C</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_C</name>
              <description>Enable divider C.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_C01</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_C</name>
              <description>Divider value for divider C in the row.  OUTPUT= INPUT / (DIVIDER_C+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).   Also note that dividide by 1 does not work if CASCADE_A_B=1.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE_B_C</name>
              <description>Cascade divider B into divider C</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_C</name>
              <description>Enable divider C.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_C02</name>
          <description>Clock Divider Configuration</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_C</name>
              <description>Divider value for divider C in the row.  OUTPUT= INPUT / (DIVIDER_C+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).   Also note that dividide by 1 does not work if CASCADE_A_B=1.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE_B_C</name>
              <description>Cascade divider B into divider C</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_C</name>
              <description>Enable divider C.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_FRAC_A00</name>
          <description>Frac Divider Configuration</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_A</name>
              <description>Divider value for divider A in the row.  OUTPUT= INPUT / (DIVIDER_A+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC_A</name>
              <description>Fractional divider value: 0/32 .. 31/32</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_A</name>
              <description>Enable divider A.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_FRAC_B00</name>
          <description>Frac Divider Configuration</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_B</name>
              <description>Divider value for divider B in the row.  OUTPUT= INPUT / (DIVIDER_B+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).  Also note that dividide by 1 does not work if CASCADE_A_B=1.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC_B</name>
              <description>Fractional divider value: 0/32 .. 31/32</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE_A_B</name>
              <description>Cascade divider A into divider B</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_B</name>
              <description>Enable divider B.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDER_FRAC_C00</name>
          <description>Frac Divider Configuration</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_C</name>
              <description>Divider value for divider C in the row.  OUTPUT= INPUT / (DIVIDER_C+1).  In other words, a value of 0 means divide by 1.  Note that selecting divide by 1 (value 0) does not work for blocks that require full DIVIDED_CLOCK clock reconstruction (See Section  20.6 in SAS).   Also note that dividide by 1 does not work if CASCADE_A_B=1.</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC_C</name>
              <description>Fractional divider value: 0/32 .. 31/32</description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CASCADE_B_C</name>
              <description>Cascade divider B into divider C</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_C</name>
              <description>Enable divider C.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT00</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT01</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT02</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
