cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>SELECT03</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT04</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT05</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT06</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT07</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT08</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT09</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT10</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT11</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT12</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT13</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
