cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>SELECT14</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELECT15</name>
          <description>Clock Routing Configuration</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DIVIDER_N</name>
              <description>Select divider bank row to source clock from. ?Addressed as following:?0 to NUMDIV-1: Non-fractional divider?NUMDIV to NUMFRACDIV: Fractional divider?E.g. PSOC4A NUMDIV=3, NUMFRACDIV=1?0 to 2: non-fractional divider 0 to 2?3: fractional divider 0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVIDER_ABC</name>
              <description>Select which divider from row to use.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TST</name>
      <description>Test Subsystem</description>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Main Test Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DAP_NO_ACCESS</name>
              <description>1: Block all AHB accesses from SWD port (effectively disabling it)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>DAP_NO_DEBUG</name>
              <description>1: Block all AHB accesses to CM0 Debug (PPB) Registers (effectively disabling debugger capability).</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>SWD_CONNECTED</name>
              <description>0: SWD not active?1: SWD activated (Line Reset &amp; Connect sequence passed)?(Note this bit is duplicated in TST_MODE.SWD_CONNECTED for user mode access)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TEST_RESET_EN_N</name>
              <description>Enable async reset test points during scan. This bit is further gated using a scan control chain. See SAS for more details.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_SET_EN_N</name>
              <description>Enable async set test points during scan. This bit is further gated using a scan control chain. See SAS for more details.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_ICG_EN_N</name>
              <description>Enable clock gater test points during scan.  This bit is further gated using a scan control chain.  See SAS for more details.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_OCC0_1_EN_N</name>
              <description>Enable the OCC test point of Bit 1 in TRF mode.  This bit is further gated using a scan control chain.  See SAS for more details.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_OCC0_2_EN_N</name>
              <description>Enable the OCC test point of Bit 2 in TRF mode.  This bit is further gated using a scan control chain.  See SAS for more details.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_SLPISOLATE_EN</name>
              <description>Enable sleep test points in DeepSleep domain.  This bit is further gated using a scan control chain.  See SAS for more details.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_SYSISOLATE_EN</name>
              <description>Enable sleep test points in Active domain.  This bit is further gated using a scan control chain.  See SAS for more details.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_SLPRETAIN_EN</name>
              <description>Enable sleepb test points for retention registers in DeepSleep domain.  This bit is further gated using a scan control chain.  See SAS for more details.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_SYSRETAIN_EN</name>
              <description>Enable sleepb test points for retention registers in Active domain.  This bit is further gated using a scan control chain.  See SAS for more details.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_SPARE1_EN</name>
              <description>Enable bit for spare signal in scan control chain.  See SAS for more details.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEST_SPARE2_EN</name>
              <description>Enable bit for spare signal in scan control chain.  See SAS for more details.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_OCC_OBSERVE</name>
              <description>0: Normal scan mode?1: Bring out OCC clock on scan_out[0]</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_TRF1</name>
              <description>0: Do not include &lt;48MHz logic in TRF when SCAN_TRF=1?1: Include &lt;48MHz logic in TRF when SCAN_TRF=1</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_TRF</name>
              <description>0: Normal (SAF/IDDQ) scan test?1: Transition Fault scan test (can be used concurrent with SCAN_COMPRESS but not SCAN_IDDQ).</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_IDDQ</name>
              <description>0: Normal scan test?1: IDDQ scan test (can be used concurrent with SCAN_COMPRESS but not SCAN_TRF).</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_COMPRESS</name>
              <description>0: Uncompressed scan test?1: Compressed scan test</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCAN_MODE</name>
              <description>0: Normal (non-scan) mode?1: Scan mode enabled?Setting this bit will cause scan mode to activate, after which SWD ports stops operating (it is itself scannable) and no other register accesses can be made.  This bit will override PTM_MODE_EN when set.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>PTM_MODE_EN</name>
              <description>0: PTM interface disabled?1: PTM interface enabled (only when SCAN_MODE=0)</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADFT_CTRL</name>
          <description>Analog DFT Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables ADFT functionality.  Must be set for any of the ADFT switches and muxes to operate.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDFT_CTRL</name>
          <description>Digital DFT Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DFT_SEL1</name>
              <description>Select signal for DDFT output #1</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR1</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR2</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VMON</name>
                  <description>No description available</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS_VDDA_OK</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADFT_TRIP1</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADFT_TRIP2</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS1</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS2</name>
                  <description>No description available</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS3</name>
                  <description>No description available</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS4</name>
                  <description>No description available</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2CS_CLK_I2CS</name>
                  <description>No description available</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2CS_SDAIN_SI</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_SEL2</name>
              <description>Select signal for DDFT output #2</description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR1</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR2</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VMON</name>
                  <description>No description available</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS_VDDA_OK</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADFT_TRIP1</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADFT_TRIP2</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS1</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS2</name>
                  <description>No description available</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS3</name>
                  <description>No description available</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSS4</name>
                  <description>No description available</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2CS_CLK_I2CS</name>
                  <description>No description available</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2CS_SDAIN_SI</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Edge sensitivity for in-line divider on DDFT output #1 (only relevant when DIVIDE&gt;0).</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVIDE</name>
              <description>Controls in-line divider for DDFT output #1 (used for high-speed clock measurements).</description>
              <lsb>29</lsb>
              <msb>30</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>1: Enables DDFT functionality.  Connects output of DDFT mux to designated DDFT pin.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Test Mode Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SWD_CONNECTED</name>
              <description>0: SWD not active?1: SWD activated (Line Reset &amp; Connect sequence passed)?(Note: this bit is a duplicate of TST_CTRL.SWD_CONNECTED and is present in all M0S8 products except TSG4)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>TEST_MODE</name>
              <description>0: Normal operation mode?1: Test mode (any test mode)?Setting this bit will prevent BootROM from yielding execution to Flash image.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
