cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SRSS</name>
      <description>SRSSv2 Registers (Power, Clock, Reset)</description>
      <baseAddress>0x400B0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PWR_CONTROL</name>
          <description>Power Mode Control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>POWER_MODE</name>
              <description>Current power mode of the device.  Note that this field cannot be read in all power modes on actual silicon.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_SLEEP</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIBERNATE</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBUG_SESSION</name>
              <description>Indicates whether a debug session is active (CDBGPWRUPREQ signal is 1)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SESSION</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SESSION_ACTIVE</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_READY</name>
              <description>Indicates whether the low power mode regulators are ready to enter DEEPSLEEP or HIBERNATE mode.  ?0: If DEEPSLEEP or HIBERNATE mode is requested, device will enter SLEEP mode.  When low power regulators are ready, device will automatically enter the originally requested mode.?1: Normal operation.  DEEPSLEEP and HIBERNATE work as described.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_VCCD</name>
              <description>Indicates that Vccd is provided externally (on Vccd pin).  Setting this bit turns off the active regulator and will lead to system reset (PBOD) unless both Vddd and Vccd pins are supplied externally.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HVMON_ENABLE</name>
              <description>0: HV State Monitoring is disabled?1: HV State Monitoring is automatically enable by sleep controller</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HVMON_RELOAD</name>
              <description>Firmware writes 1 to reload HV State in hibernate shadow copy.  Hardware clears this bit after reload was successful.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>FIMO_DISABLE</name>
              <description>This bit is asserted during the boot process?0: Forces IMO to operate at 12MHz, ignore its frequency and trim settings and operate independent on its external references.?1: Turns IMO into normal operational mode</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIBERNATE_DISABLE</name>
              <description>0: Normal operation, HIBERNATE works as described?1: HIBERNATE bit is ignored, Hibernate mode is permanently disabled (part will go to DeepSleep instead.?Note: This bit is a write-once bit until the next reset.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>LFCLK_SHORT</name>
              <description>Short Vcclfclk and Vccdpslp power rails in DeepSleep power mode.  This mode selection affects the accuracy specifications of the ILO oscillator due to supply noise.  See Data Sheet for more details.?0: Do not short power domains?1: Short power domains</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIBERNATE</name>
              <description>Selects between HIBERNATE/DEEPSLEEP modes when Cortex-M0 enters low power mode (SleepDeep).  Note: this bit is ignored when HIBERNATE_DISABLE=1.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEP_SLEEP</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIBERNATE</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_INTR</name>
          <description>Power System Interrupt Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LVD</name>
              <description>Indicates an Low Voltage Detect interrupt</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_INTR_MASK</name>
          <description>Power System Interrupt Mask Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LVD</name>
              <description>1: Propagate interrupt to CPU</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_KEY_DELAY</name>
          <description>Power System Key&amp;Delay Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WAKEUP_HOLDOFF</name>
              <description>Delay (in 12MHz IMO clock cycles) to wait for references to settle on wakeup from hibernate/deepsleep.  PBOD is ignored and system does not resume until this delay expires. Note that the same delay on POR is hard-coded.</description>
              <lsb>0</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_CONFIG</name>
          <description>Power System Trim and Configuration</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HIB_TEST_EN</name>
              <description>Bias control for the DSBOD/HBOD. (engineering only)?0: low power biasing?1: turbo biasing</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TEST_REP</name>
              <description>When set the enhanced replica load regulation circuit is enabled.  When clear, the enhancments are disabled at the cost of higher current.  (engineering only)</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_CONFIG</name>
          <description>Bandgap Trim and Configuration</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BG_DFT_EN</name>
              <description>Enables DFT capability for Bandgap.  (engineering only)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_DFT_VREF_SEL</name>
              <description>ADFT mux select for Reference System characterization (engineering only).  Select a voltage reference to output on adft_bg_ref?0=vgnd?1=vref_fast[0]?2=vref_fast[1]?3=vref_fast[2]?4=vref_fast[3]?5=vref_fast[4]?6=vref_fast[5]?7=vref_fast[6]?8=vref_fast[7]?9=vref[0]?10=vref[1]?11=vref[2]?12=vctat?13=iref_dft (see BG_DFT_ICORE_SEL)?14=imo_iref (current)?15=inl_imoref (voltage)</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_DFT_CORE_SEL</name>
              <description>ADFT mux select for Bandgap characterization (engineering only).  Selects which BG core signal to output on adft_bg_core?0=BG core voltage selected by BG_DFT_VCORE_SEL (mux2out)?1=BG core current selected by BG_DFT_ICORE_SEL (mux1out)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_DFT_ICORE_SEL</name>
              <description>ADFT mux select for Bandgap characterization (engineering only). Selects a BG core current to output on mux1out?0=iptat (current?1=ictat (current)?2=inl_cross_over detect (voltage)?3=iref9p6u_dft (dedicated output for DFT)?Also selects a currect for iref_dft (when BG_DFT_VREF_SEL=13)?0=iref2p4u[1]?1=iptat2p4u[7]?2=iref_imo (9.6uA current output from IMO IBG)?3=iref3u_dft (dedicated output for DFT)</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BG_DFT_VCORE_SEL</name>
              <description>ADFT mux select for Bandgap characterization (engineering only). Selects a BG core voltage to output on mux2out?0=vout?1=vgnd</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VREF_EN</name>
              <description>Reference voltage enable.  Each bit enables a reference voltage used by a peripheral.</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_VMON_CONFIG</name>
          <description>Voltage Monitoring Trim and Configuration</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LVD_EN</name>
              <description>Enable Low Voltage Detect circuit.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LVD_SEL</name>
              <description>Threshold selection for Low Voltage Detect circuit.  Threshold variation is +/- 2.5% from these typical voltage choices:?0: 1.7500 V?1: 1.8000 V?2: 1.9000 V?3: 2.0000 V?4: 2.1000 V?5: 2.2000 V?6: 2.3000 V?7: 2.4000 V?8: 2.5000 V?9: 2.6000 V?10: 2.7000 V?11: 2.8000 V?12: 2.9000 V?13: 3.0000 V?14: 3.2000 V?15: 4.5000 V</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VMON_DDFT_SEL</name>
              <description>DDFT mux select for HVPOR, PBOD, and LVD circuits  (engineering only).  Selects a signal to output on adft_vmon?0: 0?1: pbod_out?2: Pulse Strecher output of pbod Monitor?3: hvpbod_out?4: Pulse Strecher output of hvpbod Monitor?5: lvi_out?6: Pulse Strecher output of lvi Monitor?7: 0</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VMON_ADFT_SEL</name>
              <description>ADFT mux select for HVPOR, PBOD, and LVD circuits  (engineering only).  Selects a signal to output on adft_vmon?0: Hi-Z?1: Comparator Input of pbod Monitor?2: Comparator Input of hvpbod Monitor?3: Comparator Input of lvi Monitor</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
