cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>CLK_IMO_SPREAD</name>
          <description>IMO Spread Spectrum Configuration</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SS_VALUE</name>
              <description>Current offset value for spread spectrum modulation.  IMO supports values 0..16.  Step size is determined by SS_RANGE.  Value is encoded in proper thermometric format for IMO in hardware.  Value can be modified in firmware only when SS_MODE=0.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS_MAX</name>
              <description>Maximum counter value for spread spectrum.  Counter will count from 0..SS_MAX..0 and keep repeating this indefinitely.  Only works when SS_MODE=1.</description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SS_RANGE</name>
              <description>Spread spectrum range (downspread when SS_VALUE=16).?3: reserved, do not use</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M1</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SS_MODE</name>
              <description>Spread Spectrum Mode.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIANGLE</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFSR</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_DFT_SELECT</name>
          <description>Clock DFT Mode Selection Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DFT_SEL1</name>
              <description>Select signal for DFT output #1.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NC</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILO</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCO</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECO</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>No description available</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPLL_OUT</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPLL_REF</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBL</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO2X</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO36</name>
                  <description>No description available</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>No description available</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFCLK</name>
                  <description>No description available</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>No description available</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALFSYSCLK</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_DIV1</name>
              <description>DFT Output Divide Down.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_SEL2</name>
              <description>Select signal for DFT output #2.</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NC</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILO</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCO</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECO</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>No description available</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPLL_OUT</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPLL_REF</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBL</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO2X</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMO36</name>
                  <description>No description available</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFCLK</name>
                  <description>No description available</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFCLK</name>
                  <description>No description available</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>No description available</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>No description available</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALFSYSCLK</name>
                  <description>No description available</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFT_DIV2</name>
              <description>DFT Output Divide Down.</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_2</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_4</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_BY_8</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_CTRLOW</name>
          <description>Watchdog Counters 0/1</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WDT_CTR0</name>
              <description>Current value of WDT Counter 0</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_CTR1</name>
              <description>Current value of WDT Counter 1</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_CTRHIGH</name>
          <description>Watchdog Counter 2</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WDT_CTR2</name>
              <description>Current value of WDT Counter 2</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_MATCH</name>
          <description>Watchdog counter match values</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WDT_MATCH0</name>
              <description>Match value for Watchdog Counter 0</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_MATCH1</name>
              <description>Match value for Watchdog Counter 1</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_CONFIG</name>
          <description>Watchdog Counters Configuration</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WDT_MODE0</name>
              <description>Watchdog Counter Action on Match (WDT_CTR0=WDT_MATCH0).</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTHING</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_THEN_RESET</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_CLEAR0</name>
              <description>Clear Watchdog Counter when WDT_CTR0=WDT_MATCH0. In other words WDT_CTR0 divides LFCLK by (WDT_MATCH0+1).?0: Free running counter?1: Clear on match</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CASCADE0_1</name>
              <description>Cascade Watchdog Counters 0,1.  Counter 1 increments the cycle after WDT_CTR0=WDT_MATCH0.?0: Independent counters?1: Cascaded counters</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_MODE1</name>
              <description>Watchdog Counter Action on Match (WDT_CTR1=WDT_MATCH1).</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTHING</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_THEN_RESET</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_CLEAR1</name>
              <description>Clear Watchdog Counter when WDT_CTR1=WDT_MATCH1. In other words WDT_CTR1 divides LFCLK by (WDT_MATCH1+1).?0: Free running counter?1: Clear on match</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CASCADE1_2</name>
              <description>Cascade Watchdog Counters 1,2.  Counter 2 increments the cycle after WDT_CTR1=WDT_MATCH1.  It is allowed to cascade all three WDT counters.?0: Independent counters?1: Cascaded counters</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_MODE2</name>
              <description>Watchdog Counter 2 Mode.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTHING</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT_BITS2</name>
              <description>Bit to observe for WDT_INT2:?0: Assert when bit0 of WDT_CTR2 toggles (one int every tick)?..?31: Assert when bit31 of WDT_CTR2 toggles (one int every 2^31 ticks)</description>
              <lsb>24</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LFCLK_SEL</name>
              <description>Select source for LFCLK:?0: ILO - Internal R/C Oscillator?1: WCO - Internal Crystal Oscillator?2-3: Reserved - do not use?Note that not all products support all clock sources.  Selecting a clock source that is not supported will result in undefined behavior.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
