cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>WDT_CONTROL</name>
          <description>Watchdog Counters Control</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>WDT_ENABLE0</name>
              <description>Enable Counter 0?0: Counter is disabled (not clocked)?1: Counter is enabled (counting up)?Note: This field takes considerable time (up to 3 LFCLK cycles) to take effect.  It must not be changed more than once in that period.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_ENABLED0</name>
              <description>Indicates actual state of counter.  May lag WDT_ENABLE0 by up to 3 LFCLK cycles.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT0</name>
              <description>WDT Interrupt Request.  This bit is set by hardware as configured by this registers.  This bit must be cleared by firmware.  Clearing this bit also prevents Reset from happening when WDT_MODEx=3.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>WDT_RESET0</name>
              <description>Resets counter 0 back to 0000.  Hardware will reset this bit after counter was reset.  This will take several LFCLK cycles to take effect.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>WDT_ENABLE1</name>
              <description>Enable Counter 1?0: Counter is disabled (not clocked)?1: Counter is enabled (counting up)?Note: This field takes considerable time (up to 3 LFCLK cycles) to take effect.  It must not be changed more than once in that period.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_ENABLED1</name>
              <description>Indicates actual state of counter.  May lag WDT_ENABLE1 by up to 3 LFCLK cycles.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT1</name>
              <description>WDT Interrupt Request.  This bit is set by hardware as configured by this registers.  This bit must be cleared by firmware.  Clearing this bit also prevents Reset from happening when WDT_MODEx=3.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>WDT_RESET1</name>
              <description>Resets counter 1 back to 0000.  Hardware will reset this bit after counter was reset.  This will take several LFCLK cycles to take effect.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>WDT_ENABLE2</name>
              <description>Enable Counter 2?0: Counter is disabled (not clocked)?1: Counter is enabled (counting up)?Note: This field takes considerable time (up to 3 LFCLK cycles) to take effect.  It must not be changed more than once in that period.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_ENABLED2</name>
              <description>Indicates actual state of counter.  May lag WDT_ENABLE2 by up to 3 LFCLK cycles.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>WDT_INT2</name>
              <description>WDT Interrupt Request.  This bit is set by hardware as configured by this registers.  This bit must be cleared by firmware.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>WDT_RESET2</name>
              <description>Resets counter 2 back to 0000_0000.  Hardware will reset this bit after counter was reset.  This will take several LFCLK cycles to take effect.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RES_CAUSE</name>
          <description>Reset Cause Observation Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RESET_WDT</name>
              <description>A WatchDog Timer reset has occurred since last power cycle.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>RESET_DSBOD</name>
              <description>This field is deprecated and will always read 0.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>RESET_LOCKUP</name>
              <description>This field is deprecated and will always read 0.  Cortex-M0 LOCKUP is no longer a reset source.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>RESET_PROT_FAULT</name>
              <description>A protection violation occurred that requires a RESET.  This includes, but is not limited to, hitting a debug breakpoint while in Privileged Mode.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>RESET_SOFT</name>
              <description>Cortex-M0 requested a system reset through it's SYSRESETREQ.  This can be done via a debugger probe or in firmware.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>RESET_HVBOD</name>
              <description>This field is deprecated and will always read 0.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>RESET_PBOD</name>
              <description>This field is deprecated and will always read 0.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>RESET_XRES</name>
              <description>This field is deprecated and will always read 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM1</name>
          <description>Power System Trim Register</description>
          <addressOffset>0xFF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HIB_BIAS_TRIM</name>
              <description>Current reference trim.  This is internally overridden to 3'b010 for startup during POR and STOP wakeup.  Afterward, it uses this setting for hibernate and sleep.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_TURBO_THRESH</name>
              <description>BOD Turbo Threshold Control?0 Turbo Threshold is set to 100mV above BOD trip point?1 Turbo Threshold is set to 50mV above BOD trip point</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD_TRIM_TRIP</name>
              <description>BOD trip point trim.  BOD_TRIM_TRIP[2] is ignored and controlled by hardware directly.?0X00: Default trim setting?0X01: Default trim setting - 30mV?0X10: Default trim setting + 30mV?0X11: Invalid Setting (Do Not Use)?1X00: Default trim setting + 90mV?1X01: Default trim setting + 60mV?1X10: Default trim setting + 120mV?1X11: Invalid Setting (Do Not Use)</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM2</name>
          <description>Power System Trim Register</description>
          <addressOffset>0xFF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>LFCLK_TRIM_LOAD</name>
              <description>Current load trim capability?00= Min current load capability?11= Max current load capability</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>LFCLK_TRIM_VOLTAGE</name>
              <description>Output voltage trim?00= default ?01= Trim lfclk by -50mV?10= Trim lfclk by +50mV?11= illegal</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DPSLP_TRIM_LOAD</name>
              <description>Current load trim capability?00= Min current load capability?11= Max current load capability</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DPSLP_TRIM_LEAKAGE</name>
              <description>Enable Vcchib pass gate leakage control</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>DPSLP_TRIM_VOLTAGE</name>
              <description>Raise output voltage?1= regulator hibernate 200mV higher?0= nominal 1.4-1.6V range</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM3</name>
          <description>Power System Trim Register</description>
          <addressOffset>0xFF08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>NWELL_TRIM</name>
              <description>Vnwell (nwell regulator) trim?[0]: Vcchib + nhv(0.6V -1V)?[1]: Vcchib + nlowvt(0.4 -0.8V)?[2]: Vcchib + nhvnat(0.1-0.3)</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>QUIET_TRIM</name>
              <description>Vccq (quiet regulator) trim</description>
              <lsb>3</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_PWRSYS_TRIM4</name>
          <description>Power System Trim Register</description>
          <addressOffset>0xFF0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HIB_TRIM_NWELL</name>
              <description>Vnwell Leakage control?00= smart nwell regulation?01= regulate nwell to constant voltage. ?10= regulate nwell to vcchib + nfet diode?11= regulate nwell to vcchib + nfet diode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TRIM_LEAKAGE</name>
              <description>Enable Vcchib pass gate leakage control</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TRIM_VOLTAGE</name>
              <description>Elevate output voltage?1= regulator hibernate 200mV higher ?0= nominal 1.4-1.6V range</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>HIB_TRIM_REFERENCE</name>
              <description>Hibernate Reference trim?10=Trim reference by -27mV?01=Trim reference by +27mV?00= no trim</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM1</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>INL_TRIM_MAIN</name>
              <description>Bandgap nonlinear current trim for curvature correction (main current reference).</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INL_CROSS_MAIN</name>
              <description>Bandgap INL cross-over point control for centering curve at 30C (main current reference).</description>
              <lsb>3</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM2</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VCTAT_SLOPE</name>
              <description>Output slope setting controls. The slope of the voltage with temperature varies from ~0% to ~15% from the value at 55C over the temperature range -40C to 150C based on control signal settings 0 to 15</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_VOLTAGE</name>
              <description>Output voltage absolute trim (LSBs).  MSB is in VCTAT_VOLTAGE_MSB field.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_ENABLE</name>
              <description>Enable VCTAT block</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VCTAT_VOLTAGE_MSB</name>
              <description>Output voltage absolute trim (MSB)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM3</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>INL_TRIM_IMO</name>
              <description>IMO Irefgen nonlinear current trim for curvature correction.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>INL_CROSS_IMO</name>
              <description>IMO Irefgen INL cross-over point control for centering curve at 30C.</description>
              <lsb>3</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM4</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ABS_TRIM_IMO</name>
              <description>IMO-irefgen output current magnitude trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BG_TRIM5</name>
          <description>Bandgap Trim Register</description>
          <addressOffset>0xFF20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TMPCO_TRIM_IMO</name>
              <description>IMO-irefgen output current temperature co-efficient trim</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_ILO_TRIM</name>
          <description>ILO Trim Register</description>
          <addressOffset>0xFF24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Trim bits to control frequency?0: Minimum frequency?15: Maximum frequency</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COARSE_TRIM</name>
              <description>Adjusts the bias in the event of high current after fab:?Bias trim:?bit3=0: Normal Mode?bit3=1:Low Current Mode??Resistor Trim (Short R to gnd):?bit2=0: Normal Mode?bit2=1: Short R/4?bit1=0: Unshort R/2?bit1=1: Normal Mode (Short R/2)?bit0=0: Unshort R/4?bit0=1: Normal Mode (Short 3R/4)</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_TRIM1</name>
          <description>IMO Trim Register</description>
          <addressOffset>0xFF28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Frequency trim bits.  These bits are determined at manufacturing time for each FREQ setting (IMO_TRIM2) and stored in SFLASH.  This field is hardware updated during USB osclock mode.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_TRIM2</name>
          <description>IMO Trim Register</description>
          <addressOffset>0xFF2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>FREQ</name>
              <description>Frequency to be selected (default 24MHz).  Frequencies can be selected from 3..48MHz. When changing this field approriate values for IMO_CLK_TRIM1, PWR_BG_TRIM4 and PWR_BG_TRIM5 must be selected from trim tables determined at manufacturing time and stored in SFLASH.  This process is documented in the SAS under "Clocks - Selecting IMO Frequency".   For encoding of this field a lookup table is required, where the frequency increases in 1MHz steps in the regions listed below.  Unspecified values have undefined behavior.  A complete lookup table is in BROS 001-59652 Sec 4.2.2.    ?[3-12] =&gt; [3MHz-12MHz]?[14-25] =&gt; [13MHz-24MHz]?[27-35] =&gt; [25MHz-33MHz]?[37-43] =&gt; [34MHz-40MHz]?[46-53] =&gt; [41MHz-48MHz]</description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_TRIM3</name>
          <description>IMO Trim Register</description>
          <addressOffset>0xFF30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TRIM_CLK36</name>
              <description>Trim bits for 36MHz oscillator.  Typically stored in SFLASH and copied here on boot.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_IMO_TRIM4</name>
          <description>IMO Trim Register</description>
          <addressOffset>0xFF34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>GAIN</name>
              <description>Gain for IMO.  Typically stored in SFLASH and copied here on boot.  Only used during USB mode, either during USB operation or when CLK_IMO_CONFIG.TEST_USB_MODE=1.  When not in USB mode, this register is not used and the actual IMO gain is forced to a setting of 0.</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>FSOFFSET</name>
              <description>Full-speed USB offset.  Updated by hardware during USB osclock mode.  Can be updated by software when TEST_USB_MODE=1.  Otherwise writes are ignored.  Engineering only.</description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
