cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UDB_W32</name>
      <description>UDB Working Registers 32-bit mode (4 consecutive UDB's)</description>
      <alternatePeripheral>UDB</alternatePeripheral>
      <baseAddress>0x400F2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>A0_00</name>
          <description>Accumulator 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>A0_0</name>
              <description>Accumulator 0 for UDB[n]</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>A0_1</name>
              <description>Accumulator 0 for UDB[n+1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>A0_2</name>
              <description>Accumulator 0 for UDB[n+2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>A0_3</name>
              <description>Accumulator 0 for UDB[n+3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A1_00</name>
          <description>Accumulator 1</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>A1_0</name>
              <description>Accumulator 1 for UDB[n]</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>A1_1</name>
              <description>Accumulator 1 for UDB[n+1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>A1_2</name>
              <description>Accumulator 1 for UDB[n+2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>A1_3</name>
              <description>Accumulator 1 for UDB[n+3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0_00</name>
          <description>Data 0</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>D0_0</name>
              <description>Data 0 for UDB[n]</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D0_1</name>
              <description>Data 0 for UDB[n+1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D0_2</name>
              <description>Data 0 for UDB[n+2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D0_3</name>
              <description>Data 0 for UDB[n+3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D1_00</name>
          <description>Data 1</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>D1_0</name>
              <description>Data 1 for UDB[n]</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1_1</name>
              <description>Data 1 for UDB[n+1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1_2</name>
              <description>Data 1 for UDB[n+2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>D1_3</name>
              <description>Data 1 for UDB[n+3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F0_00</name>
          <description>FIFO 0</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>F0_0</name>
              <description>Fifo 0 for UDB[n]</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>F0_1</name>
              <description>Fifo 0 for UDB[n+1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>F0_2</name>
              <description>Fifo 0 for UDB[n+2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>F0_3</name>
              <description>Fifo 0 for UDB[n+3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F1_00</name>
          <description>FIFO 1</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>F1_0</name>
              <description>Fifo 1 for UDB[n]</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>F1_1</name>
              <description>Fifo 1 for UDB[n+1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>F1_2</name>
              <description>Fifo 1 for UDB[n+2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>F1_3</name>
              <description>Fifo 1 for UDB[n+3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ST_00</name>
          <description>Status Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ST_0</name>
              <description>Status register for UDB[n]</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_1</name>
              <description>Status register for UDB[n+1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_2</name>
              <description>Status register for UDB[n+2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_3</name>
              <description>Status register for UDB[n+3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL_00</name>
          <description>Control Register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CTL_0</name>
              <description>Control register for UDB[n]</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL_1</name>
              <description>Control register for UDB[n+1]</description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL_2</name>
              <description>Control register for UDB[n+2]</description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTL_3</name>
              <description>Control register for UDB[n+3]</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSK_00</name>
          <description>Interrupt Mask</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>MSK_0</name>
              <description>Interrupt Mask Register</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_1</name>
              <description>Interrupt Mask Register</description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_2</name>
              <description>Interrupt Mask Register</description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK_3</name>
              <description>Interrupt Mask Register</description>
              <lsb>24</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
