cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>CFG25</name>
          <description>PLD1 Clock and Reset control</description>
          <addressOffset>0x59</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RC_EN_SEL</name>
              <description>Selects channel route for enable control to the associated UDB component block</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC_IN0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_EN_MODE</name>
              <description>Selects the operating mode for the clock to the associated UDB component block.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_EN_INV</name>
              <description>Optionally inverts the clock enable selection for the associated UDB component blocks.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_INV</name>
              <description>Optionally inverts the clock selection for the associated UDB component block.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_RES_SEL0_OR_FRES</name>
              <description>Configures the routed or firmware reset for the associated UDB component block. The meaning of this bit depends on the value of ALT RES (CFG31). ?When ALT RES = '0' - This bit is a firmware reset. ?When ALT RES = '1' - The bits {RC_SEL1,RC_SEL0_OR_FRES} s</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_RES_SEL1</name>
              <description>Configures the routed reset for the associated UDB component block. The meaning of this bit depends on the value of ALT RES (CFG31). ?When ALT RES = '0' - This bit is not used. ?When ALT RES = '1' - The bits {RC_SEL1,RC_SEL0_OR_FRES} select the RC routing</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG26</name>
          <description>Datapath Clock and Reset control</description>
          <addressOffset>0x5A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RC_EN_SEL</name>
              <description>Selects channel route for enable control to the associated UDB component block</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC_IN0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_EN_MODE</name>
              <description>Selects the operating mode for the clock to the associated UDB component block.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_EN_INV</name>
              <description>Optionally inverts the clock enable selection for the associated UDB component blocks.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_INV</name>
              <description>Optionally inverts the clock selection for the associated UDB component block.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_RES_SEL0_OR_FRES</name>
              <description>Configures the routed or firmware reset for the associated UDB component block. The meaning of this bit depends on the value of ALT RES (CFG31). ?When ALT RES = '0' - This bit is a firmware reset. ?When ALT RES = '1' - The bits {RC_SEL1,RC_SEL0_OR_FRES} s</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_RES_SEL1</name>
              <description>Configures the routed reset for the associated UDB component block. The meaning of this bit depends on the value of ALT RES (CFG31). ?When ALT RES = '0' - This bit is not used. ?When ALT RES = '1' - The bits {RC_SEL1,RC_SEL0_OR_FRES} select the RC routing</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG27</name>
          <description>Status/Control Clock and Reset control</description>
          <addressOffset>0x5B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RC_EN_SEL</name>
              <description>Selects channel route for enable control to the associated UDB component block</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC_IN0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_EN_MODE</name>
              <description>Selects the operating mode for the clock to the associated UDB component block.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_EN_INV</name>
              <description>Optionally inverts the clock enable selection for the associated UDB component blocks.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_INV</name>
              <description>Optionally inverts the clock selection for the associated UDB component block.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_RES_SEL0_OR_FRES</name>
              <description>Configures the routed or firmware reset for the associated UDB component block. The meaning of this bit depends on the value of ALT RES (CFG31). ?When ALT RES = '0' - This bit is a firmware reset. ?When ALT RES = '1' - The bits {RC_SEL1,RC_SEL0_OR_FRES} s</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_RES_SEL1</name>
              <description>Configures the routed reset for the associated UDB component block. The meaning of this bit depends on the value of ALT RES (CFG31). ?When ALT RES = '0' - This bit is not used. ?When ALT RES = '1' - The bits {RC_SEL1,RC_SEL0_OR_FRES} select the RC routing</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG28</name>
          <description>Clock Selection for PLD1 and PLD0</description>
          <addressOffset>0x5C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PLD0_CK_SEL</name>
              <description>Clock selection registers</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>No description available</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_CLK</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLD1_CK_SEL</name>
              <description>Clock selection registers</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>No description available</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>No description available</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>No description available</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>No description available</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_CLK</name>
                  <description>No description available</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>No description available</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
