cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>CFG18</name>
          <description>Control Register Mode 0 (used in conjunction with Control Register Mode 1)</description>
          <addressOffset>0x52</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CTL_MD0</name>
              <description>CTL_MD1 and CTL_MD0 are concatenated to form an encoding for the mode of each control bit in the control register.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOUBLE_SYNC</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG19</name>
          <description>Control Register Mode 1 (used in conjunction with Control Register Mode 0)</description>
          <addressOffset>0x53</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CTL_MD1</name>
              <description>CTL_MD1 and CTL_MD0 are concatenated to form an encoding for the mode of each control bit in the control register.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOUBLE_SYNC</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG20</name>
          <description>Status Register input mode selection</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>STAT_MD</name>
              <description>Mode selection for each bit of the status register. A '0' is transparent mode, where internal routing is read idrectly by CPU firmware. A '1' is sticky-clear-on-read mode, where once the given bit is set, it will stay set until the CPU reads the bit.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG21</name>
          <description>Spare register bits</description>
          <addressOffset>0x55</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>NC0</name>
              <description>Spare register bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>NC1</name>
              <description>Spare register bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG22</name>
          <description>SC block configuration control</description>
          <addressOffset>0x56</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SC_OUT_CTL</name>
              <description>Selects the output source for the Status and Control routing connections</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTROL</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARALLEL</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SC_INT_MD</name>
              <description>SC Interrupt Mode - controls when the UDB driving an interrupt generated from the masked OR reduction of status bits 6 to 0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_MODE</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SC_SYNC_MD</name>
              <description>SC Sync Mode - controls when the status register operates as a 4-bit double synchronizer module</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_MODE</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SC_EXT_RES</name>
              <description>Control register external reset operation. This bit supports autonomous usage of the control register, where a routed reset should clear the writable input registers. By default this is off because the CPU writable register can be cleared in firmware. In</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG23</name>
          <description>Counter Control</description>
          <addressOffset>0x57</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CNT_LD_SEL</name>
              <description>Selects the routing inputs for the counter load signal</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SC_IN0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SC_IN1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SC_IN2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SC_IN3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNT_EN_SEL</name>
              <description>Selects the routing inputs for the counter enable signal</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SC_IN4</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SC_IN5</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SC_IN6</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SC_IO</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROUTE_LD</name>
              <description>Configure the counter load signal for routing input</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROUTED</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROUTE_EN</name>
              <description>Configure the counter enable signal for routing input</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROUTED</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALT_CNT</name>
              <description>Configure the alternate operating mode of the counter</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT_MODE</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT_MODE</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG24</name>
          <description>PLD0 Clock and Reset control</description>
          <addressOffset>0x58</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RC_EN_SEL</name>
              <description>Selects channel route for enable control to the associated UDB component block</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC_IN0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RC_IN3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_EN_MODE</name>
              <description>Selects the operating mode for the clock to the associated UDB component block.</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POSEDGE</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEVEL</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_EN_INV</name>
              <description>Optionally inverts the clock enable selection for the associated UDB component blocks.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_INV</name>
              <description>Optionally inverts the clock selection for the associated UDB component block.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOINV</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERT</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RC_RES_SEL0_OR_FRES</name>
              <description>Configures the routed or firmware reset for the associated UDB component block. The meaning of this bit depends on the value of ALT RES (CFG31). ?When ALT RES = '0' - This bit is a firmware reset. ?When ALT RES = '1' - The bits {RC_SEL1,RC_SEL0_OR_FRES} s</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>RC_RES_SEL1</name>
              <description>Configures the routed reset for the associated UDB component block. The meaning of this bit depends on the value of ALT RES (CFG31). ?When ALT RES = '0' - This bit is not used. ?When ALT RES = '1' - The bits {RC_SEL1,RC_SEL0_OR_FRES} select the RC routing</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
