cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>PLD0IN0</name>
          <description>UDB Channel PI Tile Configuration; PLD Input</description>
          <addressOffset>0xC0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLD0IN1</name>
          <description>UDB Channel PI Tile Configuration; PLD Input</description>
          <addressOffset>0xC2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLD0IN2</name>
          <description>UDB Channel PI Tile Configuration; PLD Input</description>
          <addressOffset>0xC4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLD1IN0</name>
          <description>UDB Channel PI Tile Configuration; PLD Input</description>
          <addressOffset>0xCA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLD1IN1</name>
          <description>UDB Channel PI Tile Configuration; PLD Input</description>
          <addressOffset>0xCC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLD1IN2</name>
          <description>UDB Channel PI Tile Configuration; PLD Input</description>
          <addressOffset>0xCE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIN0</name>
          <description>UDB Channel PI Tile Configuration; Datapath Input</description>
          <addressOffset>0xD0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPIN1</name>
          <description>UDB Channel PI Tile Configuration; Datapath Input</description>
          <addressOffset>0xD2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP2</name>
              <description>RAM configuration bits (2) for TOP UDB port interface configuration</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT2</name>
              <description>RAM configuration bits (2) for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCIN</name>
          <description>UDB Channel PI Tile Configuration; Status / Control Blocks Input Control</description>
          <addressOffset>0xD6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCIOIN</name>
          <description>UDB Channel PI Tile Configuration; Status / Control Blocks Input / Output Control</description>
          <addressOffset>0xD8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCIN</name>
          <description>UDB Channel PI Tile Configuration; Reset and Clock Blocks Input Control</description>
          <addressOffset>0xDE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration nibble for TOP UDB port interface configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB port interface configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS0</name>
          <description>UDB Channel VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration nibble for TOP UDB vertical segmentation configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB vertical segmentation configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS1</name>
          <description>UDB Channel VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration nibble for TOP UDB vertical segmentation configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB vertical segmentation configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS2</name>
          <description>UDB Channel VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration nibble for TOP UDB vertical segmentation configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB vertical segmentation configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS3</name>
          <description>UDB Channel VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration nibble for TOP UDB vertical segmentation configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB vertical segmentation configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS4</name>
          <description>UDB Channel VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration nibble for TOP UDB vertical segmentation configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB vertical segmentation configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS5</name>
          <description>UDB Channel VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xEA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration nibble for TOP UDB vertical segmentation configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB vertical segmentation configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS6</name>
          <description>UDB Channel VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xEC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration nibble for TOP UDB vertical segmentation configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB vertical segmentation configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS7</name>
          <description>UDB Channel VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xEE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration nibble for TOP UDB vertical segmentation configuration</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration nibble for BOTTOM UDB vertical segmentation configuration</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
