cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UDB_P1_U0</name>
      <description>Single UDB Configuration</description>
      <alternatePeripheral>UDB</alternatePeripheral>
      <baseAddress>0x400F3200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PLD_IT0</name>
          <description>PLD Input Terms</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PLD0_ITxC_0</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_1</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_2</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_3</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_4</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_5</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_6</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_7</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_0</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_1</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_2</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_3</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_4</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_5</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_6</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_7</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_0</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_1</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_2</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_3</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_4</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_5</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_6</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_7</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_0</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_1</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_2</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_3</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_4</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_5</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_6</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_7</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLD_IT1</name>
          <description>PLD Input Terms</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PLD0_ITxC_0</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_1</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_2</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_3</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_4</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_5</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_6</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxC_7</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_0</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_1</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_2</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_3</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_4</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_5</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_6</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxC_7</name>
              <description>Complement input term. Bit position corresponds to product term</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_0</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_1</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_2</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_3</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_4</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_5</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_6</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ITxT_7</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_0</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_1</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_2</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_3</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_4</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_5</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_6</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ITxT_7</name>
              <description>True input term. Bit position corresponds to product term.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
