cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>PLD_ORT1</name>
          <description>PLD OR Terms</description>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PLD0_ORT_PTx_0</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_1</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_2</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_3</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_4</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_5</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_6</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_7</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_0</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_1</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_2</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_3</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_4</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_5</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_6</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_7</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLD_ORT2</name>
          <description>PLD OR Terms</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PLD0_ORT_PTx_0</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_1</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_2</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_3</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_4</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_5</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_6</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_7</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_0</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_1</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_2</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_3</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_4</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_5</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_6</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_7</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLD_ORT3</name>
          <description>PLD OR Terms</description>
          <addressOffset>0x36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PLD0_ORT_PTx_0</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_1</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_2</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_3</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_4</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_5</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_6</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD0_ORT_PTx_7</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_0</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_1</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_2</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_3</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_4</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_5</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_6</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLD1_ORT_PTx_7</name>
              <description>OR term. Bit position corresponds to product term.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
