cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>HS3</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x93</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS4</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x94</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS5</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x95</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS6</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x96</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS7</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x97</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS8</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x98</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS9</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x99</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS10</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x9A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS11</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x9B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS12</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x9C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS13</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x9D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS14</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x9E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS15</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x9F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS16</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0xA0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS17</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0xA1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS18</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0xA2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS19</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0xA3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS20</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0xA4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS21</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0xA5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS22</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0xA6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS23</name>
          <description>UDB Channel HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0xA7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R0</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xA8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R1</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xA9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R2</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xAA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R3</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xAB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R4</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xAC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R5</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xAD</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R6</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xAE</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R7</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xAF</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R8</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xB0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R9</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xB1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R10</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xB2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R11</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xB3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R12</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xB4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R13</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xB5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R14</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xB6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_R15</name>
          <description>UDB Channel HV Tile Configuration; Right</description>
          <addressOffset>0xB7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration bytes for channel</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
