cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>HC76</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC77</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC78</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x4E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC79</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x4F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC80</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x50</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC81</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x51</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC82</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x52</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC83</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x53</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC84</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC85</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x55</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC86</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x56</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC87</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x57</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC88</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x58</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC89</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x59</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC90</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x5A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC91</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x5B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC92</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x5C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC93</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x5D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC94</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x5E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC95</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x5F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC96</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC97</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x61</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC98</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x62</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC99</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x63</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC100</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x64</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC101</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x65</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC102</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x66</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC103</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x67</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC104</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x68</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC105</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x69</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC106</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x6A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC107</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x6B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC108</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x6C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC109</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x6D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC110</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x6E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC111</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x6F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC112</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x70</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC113</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x71</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
