cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>DSIINP3</name>
          <description>DSI PI Tile Configuration for DSI I/O; Input</description>
          <addressOffset>0xC6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIINP4</name>
          <description>DSI PI Tile Configuration for DSI I/O; Input</description>
          <addressOffset>0xC8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIINP5</name>
          <description>DSI PI Tile Configuration for DSI I/O; Input</description>
          <addressOffset>0xCA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTP0</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output pair</description>
          <addressOffset>0xCC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTP1</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output pair</description>
          <addressOffset>0xCE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTP2</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output pair</description>
          <addressOffset>0xD0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTP3</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output pair</description>
          <addressOffset>0xD2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTT0</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output triplet</description>
          <addressOffset>0xD4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTT1</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output triplet</description>
          <addressOffset>0xD6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTT2</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output triplet</description>
          <addressOffset>0xD8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTT3</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output triplet</description>
          <addressOffset>0xDA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTT4</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output triplet</description>
          <addressOffset>0xDC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSIOUTT5</name>
          <description>DSI PI Tile Configuration for DSI I/O; Output triplet</description>
          <addressOffset>0xDE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PI_TOP</name>
              <description>RAM configuration for TOP DSI port interface, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PI_BOT</name>
              <description>RAM configuration for BOTTOM DSI port interface, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS0</name>
          <description>DSI VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration for TOP DSI vertical segmentation, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration for BOTTOM DSI vertical segmentation, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS1</name>
          <description>DSI VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration for TOP DSI vertical segmentation, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration for BOTTOM DSI vertical segmentation, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS2</name>
          <description>DSI VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration for TOP DSI vertical segmentation, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration for BOTTOM DSI vertical segmentation, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS3</name>
          <description>DSI VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration for TOP DSI vertical segmentation, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration for BOTTOM DSI vertical segmentation, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS4</name>
          <description>DSI VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xE8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration for TOP DSI vertical segmentation, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration for BOTTOM DSI vertical segmentation, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS5</name>
          <description>DSI VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xEA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration for TOP DSI vertical segmentation, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration for BOTTOM DSI vertical segmentation, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS6</name>
          <description>DSI VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xEC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration for TOP DSI vertical segmentation, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration for BOTTOM DSI vertical segmentation, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VS7</name>
          <description>DSI VS Tile Configuration; Vertical Segmentation</description>
          <addressOffset>0xEE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VS_TOP</name>
              <description>RAM configuration for TOP DSI vertical segmentation, not implemented in BOTTOM DSI blocks</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BOT</name>
              <description>RAM configuration for BOTTOM DSI vertical segmentation, not implemented in TOP DSI blocks</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
