cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>HC114</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x72</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC115</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x73</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC116</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x74</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC117</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x75</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC118</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x76</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC119</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x77</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC120</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x78</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC121</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x79</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC122</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x7A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC123</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x7B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC124</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x7C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC125</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x7D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC126</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x7E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HC127</name>
          <description>DSI HC Tile Configuration</description>
          <addressOffset>0x7F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HC_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L0</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x80</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L1</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x81</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L2</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x82</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L3</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x83</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L4</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x84</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L5</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x85</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L6</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x86</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L7</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x87</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L8</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x88</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L9</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x89</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L10</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x8A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L11</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x8B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L12</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x8C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L13</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x8D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L14</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x8E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HV_L15</name>
          <description>DSI HV Tile Configuration; Left</description>
          <addressOffset>0x8F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HV_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS0</name>
          <description>DSI HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x90</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS1</name>
          <description>DSI HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x91</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS2</name>
          <description>DSI HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x92</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS3</name>
          <description>DSI HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x93</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS4</name>
          <description>DSI HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x94</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS5</name>
          <description>DSI HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x95</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS6</name>
          <description>DSI HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x96</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HS7</name>
          <description>DSI HS Tile Configuration; Horizontal Segmentation</description>
          <addressOffset>0x97</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>HS_BYTE</name>
              <description>RAM configuration for DSI channel bytes</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
