cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>CFG8</name>
          <description>PA Output Data Sync Control Register - Low</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OUT_SYNC0</name>
              <description>Synchronization selection for PA output 0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSPARENT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLESYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKINV</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT_SYNC1</name>
              <description>Synchronization selection for PA output 1</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSPARENT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLESYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKINV</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT_SYNC2</name>
              <description>Synchronization selection for PA output 2</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSPARENT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLESYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKINV</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT_SYNC3</name>
              <description>Synchronization selection for PA output 3</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSPARENT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLESYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKINV</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG9</name>
          <description>PA Output Data Sync Control Register - High</description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OUT_SYNC4</name>
              <description>Synchronization selection for PA output 4</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSPARENT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLESYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKINV</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT_SYNC5</name>
              <description>Synchronization selection for PA output 5</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSPARENT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLESYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKINV</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT_SYNC6</name>
              <description>Synchronization selection for PA output 6</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSPARENT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLESYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKINV</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT_SYNC7</name>
              <description>Synchronization selection for PA output 7</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRANSPARENT</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLESYNC</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCKINV</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG10</name>
          <description>PA Output Data Select Register - Low</description>
          <addressOffset>0xA</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA_SEL0</name>
              <description>Data selection for PA output 0</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI_OUTPUT0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_SEL1</name>
              <description>Data selection for PA output 1</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI_OUTPUT0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_SEL2</name>
              <description>Data selection for PA output 2</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI_OUTPUT0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_SEL3</name>
              <description>Data selection for PA output 3</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI_OUTPUT0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG11</name>
          <description>PA Output Data Select Register - High</description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DATA_SEL4</name>
              <description>Data selection for PA output 4</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI_OUTPUT0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_SEL5</name>
              <description>Data selection for PA output 5</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI_OUTPUT0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_SEL6</name>
              <description>Data selection for PA output 6</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI_OUTPUT0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_SEL7</name>
              <description>Data selection for PA output 7</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSI_OUTPUT0</name>
                  <description>No description available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT1</name>
                  <description>No description available</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT2</name>
                  <description>No description available</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSI_OUTPUT3</name>
                  <description>No description available</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
