cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CM0</name>
      <description>Cortex-M0 System Bus (ARM PPB Peripherals)</description>
      <baseAddress>0xE0000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DWT_PID4</name>
          <description>Watchpoint Unit CoreSight ROM Table Peripheral ID #4</description>
          <addressOffset>0x1FD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #4</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PID0</name>
          <description>Watchpoint Unit CoreSight ROM Table Peripheral ID #0</description>
          <addressOffset>0x1FE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #0</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PID1</name>
          <description>Watchpoint Unit CoreSight ROM Table Peripheral ID #1</description>
          <addressOffset>0x1FE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #1</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PID2</name>
          <description>Watchpoint Unit CoreSight ROM Table Peripheral ID #2</description>
          <addressOffset>0x1FE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #2</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_PID3</name>
          <description>Watchpoint Unit CoreSight ROM Table Peripheral ID #3</description>
          <addressOffset>0x1FEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #3</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CID0</name>
          <description>Watchpoint Unit CoreSight ROM Table Component ID #0</description>
          <addressOffset>0x1FF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #0</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CID1</name>
          <description>Watchpoint Unit CoreSight ROM Table Component ID #1</description>
          <addressOffset>0x1FF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #1</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CID2</name>
          <description>Watchpoint Unit CoreSight ROM Table Component ID #2</description>
          <addressOffset>0x1FF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #2</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT_CID3</name>
          <description>Watchpoint Unit CoreSight ROM Table Component ID #3</description>
          <addressOffset>0x1FFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #3</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_PID4</name>
          <description>Breakpoint Unit CoreSight ROM Table Peripheral ID #4</description>
          <addressOffset>0x2FD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #4</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_PID0</name>
          <description>Breakpoint Unit CoreSight ROM Table Peripheral ID #0</description>
          <addressOffset>0x2FE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #0</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_PID1</name>
          <description>Breakpoint Unit CoreSight ROM Table Peripheral ID #1</description>
          <addressOffset>0x2FE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #1</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_PID2</name>
          <description>Breakpoint Unit CoreSight ROM Table Peripheral ID #2</description>
          <addressOffset>0x2FE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #2</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_PID3</name>
          <description>Breakpoint Unit CoreSight ROM Table Peripheral ID #3</description>
          <addressOffset>0x2FEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #3</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_CID0</name>
          <description>Breakpoint Unit CoreSight ROM Table Component ID #0</description>
          <addressOffset>0x2FF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #0</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_CID1</name>
          <description>Breakpoint Unit CoreSight ROM Table Component ID #1</description>
          <addressOffset>0x2FF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #1</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_CID2</name>
          <description>Breakpoint Unit CoreSight ROM Table Component ID #2</description>
          <addressOffset>0x2FF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #2</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BP_CID3</name>
          <description>Breakpoint Unit CoreSight ROM Table Component ID #3</description>
          <addressOffset>0x2FFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #3</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_CSR</name>
          <description>Systick Control &amp; Status</description>
          <addressOffset>0xE010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Indicates the enabled status of the SysTick counter:?0 counter is disabled.?1 counter is operating.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>TICKINT</name>
              <description>Indicates whether counting to 0 causes the status of the SysTick exception to change to pending:?0 count to 0 does not affect the SysTick exception status.?1 count to 0 changes the SysTick exception status to pending.?Changing the value of the counter to 0 by writing zero to the SysTick Current Value register to 0 never changes the status of the SysTick exception.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSOURCE</name>
              <description>Indicates the SysTick clock source:?0 SysTick uses the optional external reference clock.?1 SysTick uses the processor clock.?If no external clock is provided, this bit reads as one and ignores writes.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNTFLAG</name>
              <description>Indicates whether the counter has counted to 0 since the last read of this register:?0 timer has not counted to 0.?1 timer has counted to 0.?COUNTFLAG is set to 1 by a count transition from 1 to 0.?COUNTFLAG is cleared to 0 by a read of this register, and by any write to the Current Value register.</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_RVR</name>
          <description>Systick Reload Value</description>
          <addressOffset>0xE014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>The value to load into the SYST_CVR register when the counter reaches 0.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_CVR</name>
          <description>SysTick Current Value</description>
          <addressOffset>0xE018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CURRENT</name>
              <description>Current counter value.?This is the value of the counter at the time it is sampled.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYST_CALIB</name>
          <description>SysTick Calibration Value</description>
          <addressOffset>0xE01C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TENMS</name>
              <description>Optionally, holds a reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors. If this field is zero, the calibration value is not known.</description>
              <lsb>0</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>SKEW</name>
              <description>Indicates whether the 10ms calibration value is exact:?0 10ms calibration value is exact.?1 10ms calibration value is inexact, because of the clock frequency.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>NOREF</name>
              <description>Indicates whether the IMPLEMENTATION DEFINED reference clock is provided:?0 the reference clock is implemented.?1 the reference clock is not implemented.?When this bit is 1, the CLKSOURCE bit of the SYST_CSR register is forced to 1 and cannot be cleared to 0.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISER</name>
          <description>Interrupt Set-Enable Register</description>
          <addressOffset>0xE100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Enables, or reads the enabled state of one or more interrupts. Each bit corresponds to the same numbered interrupt.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICER</name>
          <description>Interrupt Clear Enable Register</description>
          <addressOffset>0xE180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Disables, or reads the enabled state of one or more interrupts. Each bit corresponds to the same numbered interrupt.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISPR</name>
          <description>Interrupt Set-Pending Register</description>
          <addressOffset>0xE200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Changes the state of one or more interrupts to pending. Each bit corresponds to the same numbered interrupt.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICPR</name>
          <description>Interrupt Clear-Pending Register</description>
          <addressOffset>0xE280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Changes the state of one or more interrupts to not pending. Each bit corresponds to the same numbered interrupt.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR0</name>
          <description>Interrupt Priority Registers</description>
          <addressOffset>0xE400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of interrupt number N.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>Priority of interrupt number N+1.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>Priority of interrupt number N+2.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N3</name>
              <description>Priority of interrupt number N+3.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR1</name>
          <description>Interrupt Priority Registers</description>
          <addressOffset>0xE404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of interrupt number N.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>Priority of interrupt number N+1.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>Priority of interrupt number N+2.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N3</name>
              <description>Priority of interrupt number N+3.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR2</name>
          <description>Interrupt Priority Registers</description>
          <addressOffset>0xE408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of interrupt number N.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>Priority of interrupt number N+1.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>Priority of interrupt number N+2.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N3</name>
              <description>Priority of interrupt number N+3.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
