cmsis-svd/cmsis-svd/data/Infineon/psoc4a.svd
        <register>
          <name>IPR3</name>
          <description>Interrupt Priority Registers</description>
          <addressOffset>0xE40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of interrupt number N.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>Priority of interrupt number N+1.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>Priority of interrupt number N+2.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N3</name>
              <description>Priority of interrupt number N+3.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR4</name>
          <description>Interrupt Priority Registers</description>
          <addressOffset>0xE410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of interrupt number N.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>Priority of interrupt number N+1.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>Priority of interrupt number N+2.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N3</name>
              <description>Priority of interrupt number N+3.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR5</name>
          <description>Interrupt Priority Registers</description>
          <addressOffset>0xE414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of interrupt number N.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>Priority of interrupt number N+1.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>Priority of interrupt number N+2.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N3</name>
              <description>Priority of interrupt number N+3.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR6</name>
          <description>Interrupt Priority Registers</description>
          <addressOffset>0xE418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of interrupt number N.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>Priority of interrupt number N+1.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>Priority of interrupt number N+2.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N3</name>
              <description>Priority of interrupt number N+3.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPR7</name>
          <description>Interrupt Priority Registers</description>
          <addressOffset>0xE41C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_N0</name>
              <description>Priority of interrupt number N.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N1</name>
              <description>Priority of interrupt number N+1.</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N2</name>
              <description>Priority of interrupt number N+2.</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_N3</name>
              <description>Priority of interrupt number N+3.</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <description>CPUID Register</description>
          <addressOffset>0xED00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>REVISION</name>
              <description>Indicates revision. In ARM implementations this is the minor revision number n in the pn part of the rnpn revision status, see Product revision status on page xii. For release r0p0.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PARTNO</name>
              <description>Indicates part number, Cortex-M0</description>
              <lsb>4</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>CONSTANT</name>
              <description>Indicates the architecture, ARMv6-M</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Implementation defined. In ARM implementations this is the major revision number n in the rn part of the rnpn revision status, Product revision status on page xii.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>IMPLEMENTER</name>
              <description>Implementer code for ARM.</description>
              <lsb>24</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSR</name>
          <description>Interrupt Control State Register</description>
          <addressOffset>0xED04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VECTACTIVE</name>
              <description>The exception number for the current executing exception.  0= Thread mode. This is the same value as IPSR[8:0]</description>
              <lsb>0</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VECTPENDING</name>
              <description>The exception number for the highest priority pending exception. 0= No pending exceptions.?The pending state includes the effect of memory-mapped enable and mask registers. It does not include the PRIMASK special-purpose register qualifier.</description>
              <lsb>12</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ISRPENDING</name>
              <description>Indicates if an external configurable, NVIC generated, interrupt is pending.</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>ISRPREEMPT</name>
              <description>Indicates whether a pending exception will be serviced on exit from debug halt state.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>Clears a pending SysTick, whether set here or by the timer hardware.</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>PENDSTSETb</name>
              <description>Sets a pending SysTick or reads back the current state. Writing PENDSTSET and PENDSTCLR to '1' concurrently is UNPREDICTABLE.</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>PENDSVCLR</name>
              <description>Clears a pending PendSV interrupt.</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>PENDSVSET</name>
              <description>Sets a pending PendSV interrupt or reads back the current state.  Use this normally to request a context switch.  Writing PENDSVSET and PENDSVCLR to '1' concurrently is UNPREDICTABLE.</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>NMIPENDSET</name>
              <description>Activates an NMI exception or reads back the current state.?Because NMI is the highest priority exception, it activates as soon as it is registered.</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>writeOnce</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AIRCR</name>
          <description>Application Interrupt and Reset Control Register</description>
          <addressOffset>0xED0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VECTCLRACTIVE</name>
              <description>Clears all active state information for fixed and configurable?exceptions.  The effect of writing a 1 to this bit if the processor is not halted in Debug state is UNPREDICTABLE.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>SYSRESETREQ</name>
              <description>System Reset Request.  Writing 1 to this bit asserts a signal to request a reset by the external system. This will cause a full system reset of the CPU and all other components in the device.  See Reset management on page B1-240 for more information.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>writeOnce</access>
            </field>
            <field>
              <name>ENDIANNESS</name>
              <description>Indicates the memory system data endianness:?0 little endian?1 big endian.?See Endian support on page A3-44 for more information.</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>VECTKEY</name>
              <description>Vector Key. The value 0x05FA must be written to this register, otherwise the register write is UNPREDICTABLE.  Readback value is UNKNOWN.</description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>System Control Register</description>
          <addressOffset>0xED10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SLEEPONEXIT</name>
              <description>Determines whether, on an exit from an ISR that returns to the base level of execution priority, the processor enters a sleep state:?0 do not enter sleep state.?1 enter sleep state.?See Power management on page B1-240 for more information.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>An implementation can use this bit to select DeepSleep/Hibernate power modes upon execution of WFI/WFE:?0: Select Sleep mode?1: Select DeepSleep/Hibernate (depends on PWR_CONTROL.HIBERNATE)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>SEVONPEND</name>
              <description>Determines whether an interrupt transition from inactive state to pending state is a wakeup event:?0: transitions from inactive to pending are not wakeup events.?1: transitions from inactive to pending are wakeup events.?See WFE on page A6-197 for more information.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>Configuration and Control Register</description>
          <addressOffset>0xED14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>UNALIGN_TRP</name>
              <description>1: unaligned word and halfword accesses generate a HardFault exception.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <field>
              <name>STKALIGN</name>
              <description>1: On exception entry, the SP used prior to the exception is adjusted to be 8-byte aligned and the context to restore it is saved. The SP is restored on the associated exception return.</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR2</name>
          <description>System Handler Priority Register 2</description>
          <addressOffset>0xED1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_11</name>
              <description>Priority of system handler 11, SVCall</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR3</name>
          <description>System Handler Priority Register 3</description>
          <addressOffset>0xED20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PRI_14</name>
              <description>Priority of system handler 14, PendSV</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRI_15</name>
              <description>Priority of system handler 15, SysTick</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHCSR</name>
          <description>System Handler Control and State Register</description>
          <addressOffset>0xED24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SVCALLPENDED</name>
              <description>0 SVCall is not pending.?1 SVCall is pending.?This bit reflects the pending state on a read, and updates the pending state, to the value written, on a write. (Pending state bits are set to 1 when an exception occurs, and are cleared to 0 when an exception becomes active.)</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCS_PID4</name>
          <description>System Control Space ROM Table Peripheral ID #4</description>
          <addressOffset>0xEFD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #4</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCS_PID0</name>
          <description>System Control Space ROM Table Peripheral ID #0</description>
          <addressOffset>0xEFE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #0</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCS_PID1</name>
          <description>System Control Space ROM Table Peripheral ID #1</description>
          <addressOffset>0xEFE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #1</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCS_PID2</name>
          <description>System Control Space ROM Table Peripheral ID #2</description>
          <addressOffset>0xEFE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #2</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCS_PID3</name>
          <description>System Control Space ROM Table Peripheral ID #3</description>
          <addressOffset>0xEFEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Peripheral ID #3</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCS_CID0</name>
          <description>System Control Space ROM Table Component ID #0</description>
          <addressOffset>0xEFF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #0</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCS_CID1</name>
          <description>System Control Space ROM Table Component ID #1</description>
          <addressOffset>0xEFF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Component ID #1</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
